{"name": "long_term_memory_add", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Add a key-value pair to the long-term memory. Make sure to use meaningful keys for easy retrieval later.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key under which the value is stored. The key should be unique and case-sensitive."}, "value": {"type": "string", "description": "The value to store in the long-term memory. "}}, "required": ["key", "value"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "long_term_memory_clear", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Clear all key-value pairs from the long-term memory.", "parameters": {"type": "dict", "properties": {}, "required": []}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "long_term_memory_list_keys", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: List all keys currently in the long-term memory.", "parameters": {"type": "dict", "properties": {}, "required": []}, "response": {"type": "dict", "properties": {"keys": {"type": "array", "description": "A list of all keys in the long-term memory.", "items": {"type": "string"}}}}}
{"name": "long_term_memory_remove", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Remove a key-value pair from the long-term memory.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to remove from the long-term memory. Case-sensitive. "}}, "required": ["key"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "long_term_memory_replace", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Replace a key-value pair in the long-term memory with a new value.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to replace in the long-term memory. Case-sensitive."}, "value": {"type": "string", "description": "The new value associated with the key. "}}, "required": ["key", "value"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "long_term_memory_retrieve", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Retrieve the value associated with a key from the long-term memory.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to retrieve. Case-sensitive. "}}, "required": ["key"]}, "response": {"type": "dict", "properties": {"value": {"type": "string", "description": "The value associated with the key."}}}}
{"name": "send_message_to_user", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Send a message to the user. This is the ONLY way to provide visible text or notifications to the user. The user does not see any of your internal operations, such as managing memory or other function calls, unless you explicitly use 'send_message_to_user' to share that information.", "parameters": {"type": "dict", "properties": {"message": {"type": "string", "description": "The message to send to the user."}}, "required": ["message"]}, "response": {"type": "dict", "properties": {}}}
{"name": "short_term_memory_add", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Add a key-value pair to the short-term memory. Make sure to use meaningful keys for easy retrieval later.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key under which the value is stored. The key should be unique and case-sensitive."}, "value": {"type": "string", "description": "The value to store in the short-term memory. "}}, "required": ["key", "value"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "short_term_memory_clear", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Clear all key-value pairs from the short-term memory.", "parameters": {"type": "dict", "properties": {}, "required": []}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "short_term_memory_list_keys", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: List all keys currently in the short-term memory.", "parameters": {"type": "dict", "properties": {}, "required": []}, "response": {"type": "dict", "properties": {"keys": {"type": "array", "description": "A list of all keys in the short-term memory.", "items": {"type": "string"}}}}}
{"name": "short_term_memory_remove", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Remove a key-value pair from the short-term memory.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to remove from the short-term memory. Case-sensitive. "}}, "required": ["key"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "short_term_memory_replace", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Replace a key-value pair in the short-term memory with a new value.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to replace in the short-term memory. Case-sensitive."}, "value": {"type": "string", "description": "The new value associated with the key. "}}, "required": ["key", "value"]}, "response": {"type": "dict", "properties": {"status": {"type": "string", "description": "Status of the operation."}}}}
{"name": "short_term_memory_retrieve", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Retrieve the value associated with a key from the short-term memory.", "parameters": {"type": "dict", "properties": {"key": {"type": "string", "description": "The key to retrieve. Case-sensitive. "}}, "required": ["key"]}, "response": {"type": "dict", "properties": {"value": {"type": "string", "description": "The value associated with the key."}}}}
{"name": "short_term_memory_retrieve_all", "description": "This tool belongs to the memory suite, which provides APIs to manage both short-term and long-term memory data. Short-term memory is limited in size and can be accessed quickly, while long-term memory is larger but takes longer to access. Both type of memory is persistent across multiple conversations with the user, and can be accessed in a later interactions. Tool description: Retrieve all key-value pairs from the short-term memory.", "parameters": {"type": "dict", "properties": {}, "required": []}, "response": {"type": "dict", "properties": {"description": "dict: A dictionary of all key-value pairs in the short-term memory."}}}
